#有一个列表，[”北京“，”上海“，”广东“]
#1, 将中国所有省会城市添加到上述列表中
#2,广东成为第二大发达城市，将广东排在上海前面
#3,[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
# 这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
# list = ["北京","上海","广东"]
# list1 = ["哈尔滨","长春","呼和浩特","天津","石家庄","济南","太原","西安","兰州","乌鲁木齐","西宁","拉萨"
#         ,"成都","郑州","南京","合肥","武汉","重庆","贵阳","长沙","南昌","杭州","福州","昆明",
#         "南宁","广州","海口","香港","澳门","台北"]
#
# for i in list1:
#     list.append(i)
# print(list)
#
# list[1],list[2] = list[2],list[1]#角标
# print(list)

#求总和
# GDP = [36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
# sum = 0
# for i in range(len(GDP)):
#     sum = sum+GDP[i]
# print(sum)

#求平均值
GDP = [36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
b = len(GDP)
sum = 0
for i in GDP:
   sum = sum + i
print(sum/b)









#有以下一个列表，求其中是5的倍数的和
#a = [1,5,21,30,15,9,30,24]
# c = 0
# a = [1,5,21,30,15,9,30,24]
# for i in range(len(a)):
#     b = a[i]
#     if b%5 == 0:
#         c = c + b
# print(c)



#有下列列表，请编程实现列表的数据翻转（京东的题）
#list = [1,2,3,4,5,6,7,8,9]
#实现效果：list = [9,8,7,6,5,4,3,2,1]
# list = [1,2,3,4,5,6,7,8,9]
# list1 = []
# i=1
# j=8
# while i<=len(list):
#     list1.append(list[j])
#     j-=1
#     i+=1
# print(list1)



#请编程统计列表中的每个数字出现的次数（百度的题）
#list = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
# 方法1：使用for循环，获取list中每个元素出现的次数
from  collections import Counter
# list = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
# num_count = {}
# for i in list:
#     if i not in num_count:
#         num_count[i] = 1
#     else:
#         num_count[i] += 1
# print(num_count)